Here is where I will type my work for Week 02.

*** My Answer


    #+BEGIN_SRC python :results output
      limit = 50
      print ['a' * i + 'b' * j for i in range(5) for j in range(5) if j >= 0 and i < j]
    #+END_SRC

    #+RESULTS:
    : ['b', 'bb', 'bbb', 'bbbb', 'abb', 'abbb', 'abbbb', 'aabbb', 'aabbbb', 'aaabbbb']

    \epsilon is not a member of L_{(a_lt_b)} because the amount of a's and b's in \epsilon is
    equal, and this is disallowed by the condition i < j.

*** My Answer

    This is the decompressed version of the list comprehension. This answer is
    inspired by https://stackoverflow.com/a/1482320/6074048, where I learned a
    great algorithm for how to do this. 

    #+BEGIN_SRC python :results output
      # Declare the string
      s = "abc"

      # This method depends on the fact that counting in binary enumerates all the
      # possible states of a set. This is possible if one considers that a '0' bit in
      # the binary count denotes an element of the set that is to be excluded from
      # the subset, and a '1' bit denotes an element of the set that is to be
      # included in the subset.

      # For example, '101' should be read as saying that 'a' is included in the
      # subset, 'b' is excluded, and 'c' is included

      # Iterate over the numbers between 1 and the number of letters in s. I call
      # these the set numbers, because each set has its own number.

      # At each iteration, use the set number to check which of the characters in s
      # needs to be included in the subset. This is done by bitshifting 0x1 left to
      # check each position in s to see if the bits of the set number dictate that it
      # is to be included in the subset

      for setnumber in range(2**len(s)):
          for letternumber in range(len(s)):
              if (setnumber & (2 ** letternumber)):
                  print s[letternumber],
          print ""
    #+END_SRC

    #+RESULTS:
    : 
    : a 
    : b 
    : a b 
    : c 
    : a c 
    : b c 
    : a b c 

    #+BEGIN_SRC python :results output
      # The faster way to do this, which looks just like the code that I learned how
      # to do this from, is as follows

      s = "abc"
      print [[s[letternumber] for letternumber in range(len(s)) if (setnumber & (1 << letternumber))] for setnumber in range(1 << len(s))]

    #+END_SRC

    #+RESULTS:
    : [[], ['a'], ['b'], ['a', 'b'], ['c'], ['a', 'c'], ['b', 'c'], ['a', 'b', 'c']]

*** My Answer

  #+BEGIN_SRC python :results output
    n = 5
    print ['(' * i + ')' * i for i in range(6)]
  #+END_SRC

  #+RESULTS:
  : ['', '()', '(())', '((()))', '(((())))', '((((()))))']

*** My Answer

    Because the exponent to which the string '0' is raised will always be even,
    the strings in L_E will always be even length strings composed solely of
    multiples of the string '0'.

    #+BEGIN_SRC python :results show
      limit = 5
      L_E = ['0' * (2 * i) for i in range(limit)]
      return L_E
    #+END_SRC

    #+RESULTS:
    |   | 00 | 0000 | 000000 | 00000000 |

*** My Answer


    #+BEGIN_SRC python :results output
      limit = 5
      L_0 = ['0' * (2 * i + 1) for i in range(limit)]
      L_E = ['0' * (2 * i) for i in range(limit)]
      print "L_0 = ", L_0
      print "L_E = ", L_E

      union = sorted(L_0 + L_E)
      print "L_0 U L_E = ", union
    #+END_SRC

    #+RESULTS:
    : L_0 =  ['0', '000', '00000', '0000000', '000000000']
    : L_E =  ['', '00', '0000', '000000', '00000000']
    : L_0 U L_E =  ['', '0', '00', '000', '0000', '00000', '000000', '0000000', '00000000', '000000000']

